# -*- org-publish-use-timestamps-flag: nil; -*-
#+title: Configurations
#+author: Preston Pan
#+date: <2023-06-10 Sat>
#+language: en
#+html_head: <link rel="stylesheet" type="text/css" href="../style.css" />
#+OPTIONS: broken-links:t
* What is this magic?
They're configurations for extremely obscure programs I use. Yeah, I know, I'm somewhat of a hipster myself.
Also, this is kind of outdated, because I use my [[https://git.nullring.xyz/toughnix.git/about][NixOS Configuration]] instead. Well, I still use the vanilla
(not doom) emacs configuration.
** Configurations
Here is a list of my configurations for various programs:
@@html: <div class="links-page">@@
#+begin_src shell :results output raw :exports both
  for f in *;
  do
      if [[ "$f" == "index.org" || "$f" == "README.org" || "$f" == "emacs.el" ]]; then
          continue
      fi
      name="$(grep '^#+title:' "$f" | sed 's/^#+title:[[:space:]]*//')"
      printf -- "- [[file:$f][$name]]\n"
  done
#+end_src

#+RESULTS:
- [[file:doom.org][Doom Literate Config]]
- [[file:elfeed.org][Interesting RSS Feeds]]
- [[file:emacs.org][Emacs Configuration]]
- [[file:fish.org][Fish RC File]]
- [[file:kmonad.org][KMonad Configuration]]
- [[file:nix.org][NixOS Configuration]]
- [[file:qtile.org][My Qtile Config (Mocha)]]
- [[file:qutebrowser.org][Qutebrowser Configuration]]

@@html: </div>@@
